read_verilog verilog/top.v
hierarchy -top top \
	  -libdir verilog/game \
	  -libdir verilog/utils \
	  -libdir verilog/display
synth_ice40
write_json ICEshooter.json